# Задача: вывести на экран Hello, Word!
# Комментарий  - способ добавление пояснения к коду
# ctrl + / - закомментировать строку
# print - команда выводит информацию на экран
# Текст всегда заключен в двойные кавычки
# Данные, которые передаются команде print
# называются аргументами (что именно выводить)

print("Hello, Word!")