"""
Task 1.
Создайте список, который содержит несколько названий фруктов.
Выведите его на экран так, чтобы каждое название выводилось с новой строки.
"""

fruits_list = ["Ананас", "Виноград", "Яблоко", "Лимон", "Мандарин"]
for fruit in fruits_list:
    print(fruit)